{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\gaeta\Documents\GitHub\TimeSeries\Assignments\A5Q1VF.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}25 Mar 2021, 11:30:51

{com}. 
. import excel "C:\Users\gaeta\Documents\GitHub\TimeSeries\Data\fredgraph.xls", sheet("FRED Graph") firstrow
{res}{text}(5 vars, 164 obs)

{com}. 
. tsset index
{res}{txt}{col 9}time variable:  {res}{col 25}index, 1.00 to 110.00
{txt}{col 17}delta:  {res}1 unit

{com}. 
. tsline ln_Y
{res}
{com}. 
. tsline CPI
{res}
{com}. 
. tsline ffr
{res}
{com}. 
. generate d_P=d.CPI
{txt}(55 missing values generated)

{com}. 
. generate ln_P=log(CPI)
{txt}(54 missing values generated)

{com}. 
. generate d_lnY=d.ln_Y
{txt}(55 missing values generated)

{com}. 
. generate d_ffr=d.ffr
{txt}(55 missing values generated)

{com}. 
. tsline d_P
{res}
{com}. 
. tsline ln_P
{res}
{com}. 
. tsline d_lnY
{res}
{com}. 
. tsline d_ffr
{res}
{com}. 
. matrix A2 = (1,0,0 \ .,1,0 \ .,.,1)

. 
. matrix B2 = (.,0,0 \ 0,.,0 \ 0,0,.)

. 
. svar ln_P ln_Y ffr, lags(1/8) aeq(A2) beq(B2)
{res}{txt}Estimating short-run parameters
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-326.74714}  
Iteration 1:{space 3}log likelihood = {res:  223.0555}  
Iteration 2:{space 3}log likelihood = {res: 762.29023}  
Iteration 3:{space 3}log likelihood = {res: 817.47859}  
Iteration 4:{space 3}log likelihood = {res: 822.09133}  
Iteration 5:{space 3}log likelihood = {res: 822.31679}  
Iteration 6:{space 3}log likelihood = {res: 822.31718}  
Iteration 7:{space 3}log likelihood = {res: 822.31718}  
{res}
{txt}Structural vector autoregression

{p 0 7}{space 1}{text:( 1)}{space 1} {res}[/A]1_1 = 1{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} [/A]1_2 = 0{p_end}
{p 0 7}{space 1}{text:( 3)}{space 1} [/A]1_3 = 0{p_end}
{p 0 7}{space 1}{text:( 4)}{space 1} [/A]2_2 = 1{p_end}
{p 0 7}{space 1}{text:( 5)}{space 1} [/A]2_3 = 0{p_end}
{p 0 7}{space 1}{text:( 6)}{space 1} [/A]3_3 = 1{p_end}
{p 0 7}{space 1}{text:( 7)}{space 1} [/B]1_2 = 0{p_end}
{p 0 7}{space 1}{text:( 8)}{space 1} [/B]1_3 = 0{p_end}
{p 0 7}{space 1}{text:( 9)}{space 1} [/B]2_1 = 0{p_end}
{p 0 7}{space 1}{text:(10)}{space 1} [/B]2_3 = 0{p_end}
{p 0 7}{space 1}{text:(11)}{space 1} [/B]3_1 = 0{p_end}
{p 0 7}{space 1}{text:(12)}{space 1} [/B]3_2 = 0{p_end}

{col 1}{txt}Sample:  {res}9.00 - 110.00 {txt}{col 49}Number of obs{col 67}= {res}       102
{txt}Exactly identified model{col 49}Log likelihood{col 67}=  {res} 822.3172

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/A           {txt}{c |}
{space 9}1_1 {c |}{col 14}{res}{space 2}        1{col 26}{txt}  (constrained)
{space 9}2_1 {c |}{col 14}{res}{space 2} .2614852{col 26}{space 2} .1547921{col 37}{space 1}    1.69{col 46}{space 3}0.091{col 54}{space 4}-.0419017{col 67}{space 3} .5648721
{txt}{space 9}3_1 {c |}{col 14}{res}{space 2}-10.35325{col 26}{space 2} 13.75088{col 37}{space 1}   -0.75{col 46}{space 3}0.452{col 54}{space 4}-37.30447{col 67}{space 3} 16.59797
{txt}{space 9}1_2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_2 {c |}{col 14}{res}{space 2}        1{col 26}{txt}  (constrained)
{space 9}3_2 {c |}{col 14}{res}{space 2}-22.17351{col 26}{space 2} 8.675407{col 37}{space 1}   -2.56{col 46}{space 3}0.011{col 54}{space 4}-39.17699{col 67}{space 3}-5.170025
{txt}{space 9}1_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}3_3 {c |}{col 14}{res}{space 2}        1{col 26}{txt}  (constrained)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/B           {txt}{c |}
{space 9}1_1 {c |}{col 14}{res}{space 2} .0027529{col 26}{space 2} .0001927{col 37}{space 1}   14.28{col 46}{space 3}0.000{col 54}{space 4} .0023751{col 67}{space 3} .0031306
{txt}{space 9}2_1 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}3_1 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}1_2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_2 {c |}{col 14}{res}{space 2} .0043036{col 26}{space 2} .0003013{col 37}{space 1}   14.28{col 46}{space 3}0.000{col 54}{space 4}  .003713{col 67}{space 3} .0048942
{txt}{space 9}3_2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}1_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}3_3 {c |}{col 14}{res}{space 2} .3770695{col 26}{space 2} .0264001{col 37}{space 1}   14.28{col 46}{space 3}0.000{col 54}{space 4} .3253261{col 67}{space 3} .4288128
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. irf create svar1, step(24) set(Graph, replace)
{txt}(file Graph.irf created)
(file Graph.irf now active)
(file Graph.irf updated)

{com}. 
. irf cgraph (svar1 ln_P ln_P sirf) (svar1 ln_P ln_Y sirf)  (svar1 ln_P ffr sirf) (svar1 ln_Y ln_P sirf) (svar1 ln_Y ln_Y sirf) (svar1 ln_Y ffr sirf) (svar1 ffr ln_P sirf) (svar1 ffr ln_Y sirf) (svar1 ffr ffr sirf), title ("Irfs of VAR Model 2", size(vsmall))
{res}
{com}. 
. svar ln_Y ln_P  ffr, lags(1/8) aeq(A2) beq(B2)
{res}{txt}Estimating short-run parameters
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-326.74681}  
Iteration 1:{space 3}log likelihood = {res: 222.91504}  
Iteration 2:{space 3}log likelihood = {res: 731.38945}  
Iteration 3:{space 3}log likelihood = {res: 793.88201}  
Iteration 4:{space 3}log likelihood = {res: 821.32662}  
Iteration 5:{space 3}log likelihood = {res: 822.31222}  
Iteration 6:{space 3}log likelihood = {res: 822.31718}  
Iteration 7:{space 3}log likelihood = {res: 822.31718}  
{res}
{txt}Structural vector autoregression

{p 0 7}{space 1}{text:( 1)}{space 1} {res}[/A]1_1 = 1{p_end}
{p 0 7}{space 1}{text:( 2)}{space 1} [/A]1_2 = 0{p_end}
{p 0 7}{space 1}{text:( 3)}{space 1} [/A]1_3 = 0{p_end}
{p 0 7}{space 1}{text:( 4)}{space 1} [/A]2_2 = 1{p_end}
{p 0 7}{space 1}{text:( 5)}{space 1} [/A]2_3 = 0{p_end}
{p 0 7}{space 1}{text:( 6)}{space 1} [/A]3_3 = 1{p_end}
{p 0 7}{space 1}{text:( 7)}{space 1} [/B]1_2 = 0{p_end}
{p 0 7}{space 1}{text:( 8)}{space 1} [/B]1_3 = 0{p_end}
{p 0 7}{space 1}{text:( 9)}{space 1} [/B]2_1 = 0{p_end}
{p 0 7}{space 1}{text:(10)}{space 1} [/B]2_3 = 0{p_end}
{p 0 7}{space 1}{text:(11)}{space 1} [/B]3_1 = 0{p_end}
{p 0 7}{space 1}{text:(12)}{space 1} [/B]3_2 = 0{p_end}

{col 1}{txt}Sample:  {res}9.00 - 110.00 {txt}{col 49}Number of obs{col 67}= {res}       102
{txt}Exactly identified model{col 49}Log likelihood{col 67}=  {res} 822.3172

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/A           {txt}{c |}
{space 9}1_1 {c |}{col 14}{res}{space 2}        1{col 26}{txt}  (constrained)
{space 9}2_1 {c |}{col 14}{res}{space 2} .1040797{col 26}{space 2} .0616123{col 37}{space 1}    1.69{col 46}{space 3}0.091{col 54}{space 4}-.0166783{col 67}{space 3} .2248377
{txt}{space 9}3_1 {c |}{col 14}{res}{space 2}-22.17351{col 26}{space 2} 8.675407{col 37}{space 1}   -2.56{col 46}{space 3}0.011{col 54}{space 4}-39.17699{col 67}{space 3}-5.170025
{txt}{space 9}1_2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_2 {c |}{col 14}{res}{space 2}        1{col 26}{txt}  (constrained)
{space 9}3_2 {c |}{col 14}{res}{space 2}-10.35325{col 26}{space 2} 13.75088{col 37}{space 1}   -0.75{col 46}{space 3}0.452{col 54}{space 4}-37.30447{col 67}{space 3} 16.59797
{txt}{space 9}1_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}3_3 {c |}{col 14}{res}{space 2}        1{col 26}{txt}  (constrained)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}/B           {txt}{c |}
{space 9}1_1 {c |}{col 14}{res}{space 2} .0043634{col 26}{space 2} .0003055{col 37}{space 1}   14.28{col 46}{space 3}0.000{col 54}{space 4} .0037646{col 67}{space 3} .0049621
{txt}{space 9}2_1 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}3_1 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}1_2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_2 {c |}{col 14}{res}{space 2} .0027151{col 26}{space 2} .0001901{col 37}{space 1}   14.28{col 46}{space 3}0.000{col 54}{space 4} .0023425{col 67}{space 3} .0030877
{txt}{space 9}3_2 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}1_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}2_3 {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (constrained)
{space 9}3_3 {c |}{col 14}{res}{space 2} .3770695{col 26}{space 2} .0264001{col 37}{space 1}   14.28{col 46}{space 3}0.000{col 54}{space 4} .3253261{col 67}{space 3} .4288128
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. irf create svar2, step(24) set(Graph, replace)
{txt}(file Graph.irf created)
(file Graph.irf now active)
(file Graph.irf updated)

{com}. 
. irf cgraph (svar2 ln_P ln_P sirf) (svar2 ln_P ln_Y sirf)  (svar2 ln_P ffr sirf) (svar2 ln_Y ln_P sirf) (svar2 ln_Y ln_Y sirf) (svar2 ln_Y ffr sirf) (svar2 ffr ln_P sirf) (svar2 ffr ln_Y sirf) (svar2 ffr ffr sirf), title ("Irfs of VAR Model 2", size(vsmall))
{res}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\gaeta\Documents\GitHub\TimeSeries\Assignments\A5Q1VF.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}25 Mar 2021, 11:31:31
{txt}{.-}
{smcl}
{txt}{sf}{ul off}